FreeRTOS/FreeRTOS/FreeRTOS/Test/VeriFast/smp/tasks/vTaskSwitchContext/portable/ThirdParty/GCC/RP2040/port.c
/*
 * See header file for description.
 */
StackType_t * pxPortInitialiseStack( StackType_t * pxTopOfStack,
                                     TaskFunction_t pxCode,
                                     void * pvParameters )
//@ requires true;
//@ ensures true;
{
    /* Simulate the stack frame as it would be created by a context switch
     * interrupt. */
    pxTopOfStack--;                                          /* Offset added to account for the way the MCU uses the stack on entry/exit of interrupts. */
    *pxTopOfStack = portINITIAL_XPSR;                        /* xPSR */
    pxTopOfStack--;
    *pxTopOfStack = ( StackType_t ) pxCode;                  /* PC */
    pxTopOfStack--;
    *pxTopOfStack = ( StackType_t ) portTASK_RETURN_ADDRESS; /* LR */
    pxTopOfStack -= 5;                                       /* R12, R3, R2 and R1. */
    *pxTopOfStack = ( StackType_t ) pvParameters;            /* R0 */
    pxTopOfStack -= 8;                                       /* R11..R4. */

    return pxTopOfStack;
}
/*-----------------------------------------------------------*/

static void prvTaskExitError( void )
{
    /* A function that implements a task must not exit or attempt to return to
     * its caller as there is nothing to return to.  If a task wants to exit it
     * should instead call vTaskDelete( NULL ). */
    panic_unsupported();
}
/*-----------------------------------------------------------*/

void vPortSVCHandler( void )
{
    /* This function is no longer used, but retained for backward
     * compatibility. */
}
/*-----------------------------------------------------------*/

void vPortStartFirstTask( void )
{
    __asm volatile (
        "    .syntax unified                    \n"
        #if configRESET_STACK_POINTER
            "   ldr  r0, =0xE000ED08            \n" /* Use the NVIC offset register to locate the stack. */
            "   ldr r0, [r0]                    \n"
            "   ldr r0, [r0]                    \n"
            "   msr msp, r0                     \n" /* Set the msp back to the start of the stack. */
        #endif /* configRESET_STACK_POINTER */
        #if portRUNNING_ON_BOTH_CORES
            "   adr r1, ulAsmLocals             \n"/* Get the location of the current TCB for the current core. */
            "   ldmia r1!, {r2, r3}             \n"
            "   ldr r2, [r2]                    \n"/* r2 = Core number */
            "   lsls r2, #2                     \n"
            "   ldr r3, [r3, r2]                \n"/* r3 = pxCurrentTCBs[get_core_num()] */
        #else
            "   ldr r3, =pxCurrentTCBs          \n"
            "   ldr r3, [r3]                    \n" /* r3 = pxCurrentTCBs[0] */
        #endif /* portRUNNING_ON_BOTH_CORES */
        "    ldr  r0, [r3]                       \n"/* The first item in pxCurrentTCB is the task top of stack. */
        "    adds r0, #32                        \n"/* Discard everything up to r0. */
        "    msr  psp, r0                        \n"/* This is now the new top of stack to use in the task. */
        "    movs r0, #2                         \n"/* Switch to the psp stack. */
        "    msr  CONTROL, r0                    \n"
        "    isb                                 \n"
        "    pop  {r0-r5}                        \n"/* Pop the registers that are saved automatically. */
        "    mov  lr, r5                         \n"/* lr is now in r5. */
        "    pop  {r3}                           \n"/* Return address is now in r3. */
        "    pop  {r2}                           \n"/* Pop and discard XPSR. */
        "    cpsie i                             \n"/* The first task has its context and interrupts can be enabled. */
        "    bx   r3                             \n"/* Finally, jump to the user defined task code. */
        #if portRUNNING_ON_BOTH_CORES
            "                                   \n"
            "     .align 4                      \n"
            "ulAsmLocals:                       \n"
            "    .word 0xD0000000               \n"/* SIO */
            "    .word pxCurrentTCBs            \n"
        #endif /* portRUNNING_ON_BOTH_CORES */
    );
}
/*-----------------------------------------------------------*/

static void prvFIFOInterruptHandler()
{
    /* We must remove the contents (which we don't care about)
     * to clear the IRQ */
    multicore_fifo_drain();
    /* And explicitly clear any other IRQ flags */
    multicore_fifo_clear_irq();
    #if ( portRUNNING_ON_BOTH_CORES == 1 )
        portYIELD_FROM_ISR(pdTRUE);
    #elif ( configSUPPORT_PICO_SYNC_INTEROP == 1 )
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        uint32_t ulSave = spin_lock_blocking( pxCrossCoreSpinLock );
        EventBits_t ulBits = uxCrossCoreEventBits;
        uxCrossCoreEventBits &= ~ulBits;
        spin_unlock( pxCrossCoreSpinLock, ulSave );
        xEventGroupSetBitsFromISR( xEventGroup, ulBits, &xHigherPriorityTaskWoken );
        portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
    #endif /* portRUNNING_ON_BOTH_CORES */
}

/*
 * See header file for description.
 */
static BaseType_t xPortStartSchedulerOnCore()
{
    if( ucPrimaryCoreNum == get_core_num())
    {
        /* Start the timer that generates the tick ISR.  Interrupts are disabled
         * here already. */
        vPortSetupTimerInterrupt();

        /* Make PendSV, CallSV and SysTick the same priority as the kernel. */
        portNVIC_SHPR3_REG |= portNVIC_SYSTICK_PRI;
        #if ( configUSE_DYNAMIC_EXCEPTION_HANDLERS == 1 )
            exception_set_exclusive_handler( SYSTICK_EXCEPTION, xPortSysTickHandler );
        #endif
    }

    portNVIC_SHPR3_REG |= portNVIC_PENDSV_PRI;

    #if ( configUSE_DYNAMIC_EXCEPTION_HANDLERS == 1 )
        exception_set_exclusive_handler( PENDSV_EXCEPTION, xPortPendSVHandler );
        exception_set_exclusive_handler( SVCALL_EXCEPTION, vPortSVCHandler );
    #endif

    /* Install FIFO handler to receive interrupt from other core */
    multicore_fifo_clear_irq();
    multicore_fifo_drain();
    uint32_t ulIRQNum = SIO_IRQ_PROC0 + get_core_num();
    irq_set_priority( ulIRQNum, portMIN_INTERRUPT_PRIORITY );
    irq_set_exclusive_handler( ulIRQNum, prvFIFOInterruptHandler );
    irq_set_enabled( ulIRQNum, 1 );

    /* Start the first task. */
    vPortStartFirstTask();

