FreeRTOS/FreeRTOS/FreeRTOS/Test/VeriFast/smp/tasks/vTaskSwitchContext/portable/ThirdParty/GCC/RP2040/port.c
    /* Should never get here as the tasks will now be executing!  Call the task
     * exit error function to prevent compiler warnings about a static function
     * not being called in the case that the application writer overrides this
     * functionality by defining configTASK_RETURN_ADDRESS.  Call
     * vTaskSwitchContext() so link time optimisation does not remove the
     * symbol. */
    vTaskSwitchContext( portGET_CORE_ID() );
    prvTaskExitError();

    /* Should not get here! */
    return 0;
}

#if portRUNNING_ON_BOTH_CORES
    static void prvDisableInterruptsAndPortStartSchedulerOnCore( void )
    {
        portDISABLE_INTERRUPTS();
        xPortStartSchedulerOnCore();
    }
#endif

/*
 * See header file for description.
 */
BaseType_t xPortStartScheduler( void )
{
    configASSERT( ucPrimaryCoreNum == INVALID_PRIMARY_CORE_NUM );

    /* No one else should use these! */
    spin_lock_claim( configSMP_SPINLOCK_0 );
    spin_lock_claim( configSMP_SPINLOCK_1 );

    #if portRUNNING_ON_BOTH_CORES
        ucPrimaryCoreNum = configTICK_CORE;
        configASSERT( get_core_num() == 0) ; // we must be started on core 0
        multicore_launch_core1( prvDisableInterruptsAndPortStartSchedulerOnCore );
    #else
    ucPrimaryCoreNum = get_core_num();
    #endif
    xPortStartSchedulerOnCore();

    /* Should not get here! */
    return 0;
}
/*-----------------------------------------------------------*/

void vPortEndScheduler( void )
{
    /* Not implemented in ports where there is nothing to return to. */
    panic_unsupported();
}
/*-----------------------------------------------------------*/

void vPortYield( void )
{
    #if ( configSUPPORT_PICO_SYNC_INTEROP == 1 )
        /* We are not in an ISR, and pxYieldSpinLock is always dealt with and
         * cleared when interrupts are re-enabled, so should be NULL */
        configASSERT( pxYieldSpinLock[portGET_CORE_ID()] == NULL );
    #endif /* configSUPPORT_PICO_SYNC_INTEROP */

    /* Set a PendSV to request a context switch. */
    portNVIC_INT_CTRL_REG = portNVIC_PENDSVSET_BIT;

    /* Barriers are normally not required but do ensure the code is completely
     * within the specified behaviour for the architecture. */
    __asm volatile ( "dsb" ::: "memory" );
    __asm volatile ( "isb" );
}

void vPortEnableInterrupts( void )
{
    #if ( configSUPPORT_PICO_SYNC_INTEROP == 1 )
        int xCoreID = portGET_CORE_ID();
        if( pxYieldSpinLock[xCoreID] )
        {
            spin_lock_t* const pxTmpLock = pxYieldSpinLock[xCoreID];
            pxYieldSpinLock[xCoreID] = NULL;
            spin_unlock( pxTmpLock, ulYieldSpinLockSaveValue[xCoreID] );
        }
    #endif
    __asm volatile ( " cpsie i " ::: "memory" );
}

void vYieldCore( int xCoreID )
{
    configASSERT(xCoreID != portGET_CORE_ID());
    #if portRUNNING_ON_BOTH_CORES
        /* Non blocking, will cause interrupt on other core if the queue isn't already full,
        in which case an IRQ must be pending */
        sio_hw->fifo_wr = 0;
    #endif
}

/*-----------------------------------------------------------*/

void xPortPendSVHandler( void )
{
    /* This is a naked function. */

    __asm volatile
    (
        "   .syntax unified                     \n"
        "   mrs r1, psp                         \n"
        "                                       \n"
        "   adr    r0, ulAsmLocals2             \n"/* Get the location of the current TCB for the current core. */
        "   ldmia r0!, {r2, r3}                 \n"
        #if portRUNNING_ON_BOTH_CORES
            "   ldr r0, [r2]                    \n"/* r0 = Core number */
            "   lsls r0, r0, #2                 \n"
            "   adds r3, r0                     \n"/* r3 = &pxCurrentTCBs[get_core_num()] */
        #else
            "                                   \n"/* r3 = &pxCurrentTCBs[0] */
        #endif /* portRUNNING_ON_BOTH_CORES */
        "   ldr    r0, [r3]                     \n"/* r0 = pxCurrentTCB */
        "                                       \n"
        "   subs r1, r1, #32                    \n"/* Make space for the remaining low registers. */
        "   str r1, [r0]                        \n"/* Save the new top of stack. */
        "   stmia r1!, {r4-r7}                  \n"/* Store the low registers that are not saved automatically. */
        "   mov r4, r8                          \n"/* Store the high registers. */
        "   mov r5, r9                          \n"
        "   mov r6, r10                         \n"
        "   mov r7, r11                         \n"
        "   stmia r1!, {r4-r7}                  \n"
        #if portUSE_DIVIDER_SAVE_RESTORE
            /* We expect that the divider is ready at this point (which is
             * necessary to safely save/restore), because:
             * a) if we have not been interrupted since we entered this method,
             *    then >8 cycles have clearly passed, so the divider is done
             * b) if we were interrupted in the interim, then any "safe" - i.e.
             *    does the right thing in an IRQ - use of the divider should
             *    have waited for any in-process divide to complete, saved and
             *    then fully restored the result, thus the result is ready in
             *    that case too. */
            "   ldr r4, [r2, #0x60]             \n"/* SIO_DIV_UDIVIDEND_OFFSET */
            "   ldr r5, [r2, #0x64]             \n"/* SIO_DIV_UDIVISOR_OFFSET */
            "   ldr r6, [r2, #0x74]             \n"/* SIO_DIV_REMAINDER_OFFSET */
            "   ldr r7, [r2, #0x70]             \n"/* SIO_DIV_QUOTIENT_OFFSET */
            /* We actually save the divider state in the 4 words below
             * our recorded stack pointer, so as not to disrupt the stack
             * frame expected by debuggers - this is addressed by
             * portEXTRA_STACK_SIZE */
            "   subs r1, r1, #48                \n"
            "   stmia r1!, {r4-r7}              \n"
        #endif /* portUSE_DIVIDER_SAVE_RESTORE */
        #if portRUNNING_ON_BOTH_CORES
            "   ldr r0, [r2]                    \n"/* r0 = Core number */
        #else
            "   movs r0, #0                     \n"
        #endif /* portRUNNING_ON_BOTH_CORES */
        "   push {r3, r14}                      \n"
        "   cpsid i                             \n"
        "   bl vTaskSwitchContext               \n"
        "   cpsie i                             \n"
        "   pop {r2, r3}                        \n"/* lr goes in r3. r2 now holds tcb pointer. */
        "                                       \n"
        "   ldr r1, [r2]                        \n"
        "   ldr r0, [r1]                        \n"/* The first item in pxCurrentTCB is the task top of stack. */
        "   adds r0, r0, #16                    \n"/* Move to the high registers. */
        "   ldmia r0!, {r4-r7}                  \n"/* Pop the high registers. */
        "    mov r8, r4                         \n"
        "    mov r9, r5                         \n"
        "    mov r10, r6                        \n"
        "    mov r11, r7                        \n"
        "                                       \n"
        "   msr psp, r0                         \n"/* Remember the new top of stack for the task. */
        "                                       \n"
        #if portUSE_DIVIDER_SAVE_RESTORE
        "   movs r2, #0xd                       \n"/* Pop the divider state. */
        "   lsls r2, #28                        \n"
        "   subs r0, r0, #48                    \n"/* Go back for the divider state */
        "   ldmia r0!, {r4-r7}                  \n"/* Pop the divider state. */
        /* Note always restore via SIO_DIV_UDIVI*, because we will overwrite the
         * results stopping the calculation anyway, however the sign of results
         * is adjusted by the h/w at read time based on whether the last started
         * division was signed and the inputs' signs differed */
        "   str r4, [r2, #0x60]                \n"/* SIO_DIV_UDIVIDEND_OFFSET */
        "   str r5, [r2, #0x64]                \n"/* SIO_DIV_UDIVISOR_OFFSET */
        "   str r6, [r2, #0x74]                \n"/* SIO_DIV_REMAINDER_OFFSET */
        "   str r7, [r2, #0x70]                \n"/* SIO_DIV_QUOTIENT_OFFSET */
        #else
        "   subs r0, r0, #32                   \n"/* Go back for the low registers that are not automatically restored. */
        #endif /* portUSE_DIVIDER_SAVE_RESTORE */
        "   ldmia r0!, {r4-r7}                 \n"/* Pop low registers.  */
        "                                      \n"
        "   bx r3                              \n"
        "                                      \n"
        "   .align 4                           \n"
        "ulAsmLocals2:                         \n"
        "   .word 0xD0000000                   \n"/* SIO */
        "   .word pxCurrentTCBs                \n"
    );
}
/*-----------------------------------------------------------*/

void xPortSysTickHandler( void )
{
    uint32_t ulPreviousMask;

    ulPreviousMask = portSET_INTERRUPT_MASK_FROM_ISR();
    {
        /* Increment the RTOS tick. */
        if( xTaskIncrementTick() != pdFALSE )
        {
            /* Pend a context switch. */
            portNVIC_INT_CTRL_REG = portNVIC_PENDSVSET_BIT;
        }
    }
    portCLEAR_INTERRUPT_MASK_FROM_ISR( ulPreviousMask );
}
/*-----------------------------------------------------------*/

